org/articles/autodub.org
#+TITLE: Auto-Dubbing BOTW

* Cheaply Auto-Dubbing Breath of the Wild with Local Models

In this post, I outline a straightforward pipeline for automatically dubbing a The Legend of Zelda: Breath of the Wild (BoTW) into Mandarin Chinese. We do this with no finetuning, no external API usage, and at no cost, completing the entire project using local models that run on my home computer.

<<maybe a video would be good here>>

** Context

The Switch version of Breath of the Wild has a Chinese language translation for all the text in the game, but not for the voice acting. Properly dubbing this at the level required for release in a mainline Nintendo game would obviously be a huge and expensive project, requiring a very high bar of quality for release. But for people who just want to play in their native language, something passable might still be a big improvement.

I wanted to take a crack at creating a mod for Breath of the Wild which replaced all the audio in the game with Mandarin Chinese. I thought this would be a fun weekend project[fn:1], especially if I could get this working using only models which run locally on my computer, rather than spending money on API calls. I do not speak Mandarin very well[fn:2], so overcoming the various roadblocks was an interesting exercise in prototyping a simple ML pipeline even outside my normal expertise.

** Pipeline

*** Making the Audio Usable

Game files for BoTW are in this proprietary format called [[https://nintendo-formats.com/libs/nw/bfstm.html][BFSTM]]. This is unfortunate for us, since everything we would want to use generally requires audio to be in formats people typically use for actual everyday things.

Thankfully there's tools like [[https://github.com/vgmstream/vgmstream][vgmstream]] which will allow us to convert BFSTM to more common formats like WAV. So before we can do anything else, we need to be able to preprocess the audio files so they can actually be used and listened to. 

*** Coordinating the Script

Dumps of Breath of the Wild contain all the text data in /pack files/ which exist for several different languages in the game. The very first step here is getting all the data wrangled up together. Each voice line in the script is linked to a particular voice sound file in the game. Thankfully, this data is nicely formatted in a way which allows us to immediately know the contents of every voice file in the game, which saves us a ton of time figuring out how to transcribe all of this ourselves.

It's not so hard to create a big set of tuples $(V, E, C)$ where $V$ is the audio file for the English version, $E$ is the English text associated with that file, and $C$ is the Simplified Chinese translation of that text. We can frame our problem in a very simple way from here: $(V, E, C) \rightarrow V'$, where $V'$ is $V$ converted into Mandarin Chinese. This actually fully describes our problem: if you play with Chinese text and English audio, $(V, C)$ is what you will see in regular gameplay, so we just need to solve this single domain shift problem for every tuple in the set.

**** Reference Audio Verification + More Filtering

Unfortunately, it's not as easy at it sounds once it gets scaled all the way up. There are a number of voice lines which are "in English" which are not really english at all. For example, when you complete a shrine, the monk will tell you that you did a good job and give you a spirit orb. But this isn't really english words, it's more like "[[https://www.youtube.com/watch?v=QIGz9qRS3iI][bwahhhhhh]]" which has a subtitle. Likewise, there's lots of grunts and sounds performed by the characters which get labels in one language or the other (something like "hah!" or "ugh!") which we don't really need to dub to a new language. 

Likewise, the text is not always perfectly right at describing /all/ of the audio in the voice lines. Sometimes there's an extra sentence or two at the end, which is very annoying since this will destroy our reference text <-> reference audio mapping.

So, we need to do a transcription pass anyways. That's okay, it's mostly a one-time cost. To do this, we use a small local model -- [[https://huggingface.co/blog/CohereLabs/cohere-transcribe-03-2026-release][Cohere-transcribe]], a recent 2b parameter speech recognition model designed to transcribe text in many languages[fn:5]. We can do an initial screening pass at the very start for all the lines which are not really words (or get transcribed as empty strings, as in the case of the monks), or for lines which are much different from the associated english text[fn:10]. 

