articles/autodub.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-05 Sun 01:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Auto-Dubbing BOTW</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</a></li>
            <li class="dark-mode-nav-item"><a href="#" class="dark-mode-toggle-nav" onclick="toggleDarkMode(); return false;">🌙</a></li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Auto-Dubbing BOTW</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgce85399">Cheaply Auto-Dubbing Breath of the Wild with Local Models</a>
<ul>
<li><a href="#org2349f16">Context</a></li>
<li><a href="#org039b7ea">Pipeline</a>
<ul>
<li><a href="#orgbffcfa0">Making the Audio Usable</a></li>
<li><a href="#org651c15f">Coordinating the Script</a>
<ul>
<li><a href="#orgfbfbc00">Reference Audio Verification + More Filtering</a></li>
</ul>
</li>
<li><a href="#orgcc316b9">Generating the Audio</a></li>
<li><a href="#org0a84d9f">Detecting Early Exits</a></li>
<li><a href="#org02c976f">Dealing with "Sticky" Lines</a></li>
<li><a href="#orgb5efd3e">Improving Line Delivery</a></li>
<li><a href="#orgb008360">Improving Volume Balance</a></li>
<li><a href="#org8768cb5">Repackaging Back Into The Game</a></li>
</ul>
</li>
<li><a href="#org7ea7b8b">Results</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgce85399" class="outline-1">
<h1 id="orgce85399">Cheaply Auto-Dubbing Breath of the Wild with Local Models</h1>
<div class="outline-text-1" id="text-orgce85399">
<p>
In this post, I outline a straightforward pipeline for automatically dubbing a The Legend of Zelda: Breath of the Wild (BoTW) into Mandarin Chinese. We do this with no finetuning, no external API usage, and at no cost, completing the entire project using local models that run on my home computer.
</p>

<p>
<a id="org6b82841"></a>
</p>
</div>

<div id="outline-container-org2349f16" class="outline-2">
<h2 id="org2349f16">Context</h2>
<div class="outline-text-2" id="text-org2349f16">
<p>
The Switch version of Breath of the Wild has a Chinese language translation for all the text in the game, but not for the voice acting. Properly dubbing this at the level required for release in a mainline Nintendo game would obviously be a huge and expensive project, requiring a very high bar of quality for release. But for people who just want to play in their native language, something passable might still be a big improvement.
</p>

<p>
I wanted to take a crack at creating a mod for Breath of the Wild which replaced all the audio in the game with Mandarin Chinese. I thought this would be a fun weekend project<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>, especially if I could get this working using only models which run locally on my computer, rather than spending money on API calls. I do not speak Mandarin very well<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>, so overcoming the various roadblocks was an interesting exercise in prototyping a simple ML pipeline even outside my normal expertise.
</p>
</div>
</div>

<div id="outline-container-org039b7ea" class="outline-2">
<h2 id="org039b7ea">Pipeline</h2>
<div class="outline-text-2" id="text-org039b7ea">
</div>
<div id="outline-container-orgbffcfa0" class="outline-3">
<h3 id="orgbffcfa0">Making the Audio Usable</h3>
<div class="outline-text-3" id="text-orgbffcfa0">
<p>
Game files for BoTW are in this proprietary format called <a href="https://nintendo-formats.com/libs/nw/bfstm.html">BFSTM</a>. This is unfortunate for us, since everything we would want to use generally requires audio to be in formats people typically use for actual everyday things.
</p>

<p>
Thankfully there's tools like <a href="https://github.com/vgmstream/vgmstream">vgmstream</a> which will allow us to convert BFSTM to more common formats like WAV. So before we can do anything else, we need to be able to preprocess the audio files so they can actually be used and listened to. 
</p>
</div>
</div>

<div id="outline-container-org651c15f" class="outline-3">
<h3 id="org651c15f">Coordinating the Script</h3>
<div class="outline-text-3" id="text-org651c15f">
<p>
Dumps of Breath of the Wild contain all the text data in <i>pack files</i> which exist for several different languages in the game. The very first step here is getting all the data wrangled up together. Each voice line in the script is linked to a particular voice sound file in the game. Thankfully, this data is nicely formatted in a way which allows us to immediately know the contents of every voice file in the game, which saves us a ton of time figuring out how to transcribe all of this ourselves.
</p>

<p>
It's not so hard to create a big set of tuples \((V, E, C)\) where \(V\) is the audio file for the English version, \(E\) is the English text associated with that file, and \(C\) is the Simplified Chinese translation of that text. We can frame our problem in a very simple way from here: \((V, E, C) \rightarrow V'\), where \(V'\) is \(V\) converted into Mandarin Chinese. This actually fully describes our problem: if you play with Chinese text and English audio, \((V, C)\) is what you will see in regular gameplay, so we just need to solve this single domain shift problem for every tuple in the set.
</p>
</div>

<div id="outline-container-orgfbfbc00" class="outline-4">
<h4 id="orgfbfbc00">Reference Audio Verification + More Filtering</h4>
<div class="outline-text-4" id="text-orgfbfbc00">
<p>
Unfortunately, it's not as easy at it sounds once it gets scaled all the way up. There are a number of voice lines which are "in English" which are not really english at all. For example, when you complete a shrine, the monk will tell you that you did a good job and give you a spirit orb. But this isn't really english words, it's more like "<a href="https://www.youtube.com/watch?v=QIGz9qRS3iI">bwahhhhhh</a>" which has a subtitle. Likewise, there's lots of grunts and sounds performed by the characters which get labels in one language or the other (something like "hah!" or "ugh!") which we don't really need to dub to a new language. 
</p>

<p>
Likewise, the text is not always perfectly right at describing <i>all</i> of the audio in the voice lines. Sometimes there's an extra sentence or two at the end, which is very annoying since this will destroy our reference text &lt;-&gt; reference audio mapping.
</p>

<p>
So, we need to do a transcription pass anyways. That's okay, it's mostly a one-time cost. To do this, we use a small local model &#x2013; <a href="https://huggingface.co/blog/CohereLabs/cohere-transcribe-03-2026-release">Cohere-transcribe</a>, a recent 2b parameter speech recognition model designed to transcribe text in many languages<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>. We can do an initial screening pass at the very start for all the lines which are not really words (or get transcribed as empty strings, as in the case of the monks), or for lines which are much different from the associated english text<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>. 
</p>
</div>
</div>
</div>
