org/articles/autodub.org
*** Generating the Audio

The obvious model to use for this project, at the time of writing, is [[https://github.com/QwenLM/Qwen3-TTS][Qwen3-TTS]]. This model is 1.7B parameters so it easily fits on my RTX 3090. It is obviously specifically performant upon generating voices in Chinese, which is a hugely important part of this particular project. And, importantly, it allows for cloning a particular voice, when provided text-audio pairing. That is to say, you can provide Qwen3-TTS $(V,E)$ and it will produce a function $f(C) \rightarrow V'$ [fn:7]. That looks suspiciously like what we just said we wanted!

And indeed, it does do a pretty good job right out of the box. The output of this model is crazy impressive, especially for something just 1.7B parameters.

*English Example*

#+BEGIN_EXPORT html
<audio controls>
  <source src="../images/autodub/daruk_en.wav" type="audio/wav">
  Your browser does not support the audio element.
</audio>
#+END_EXPORT

*Chinese Example*

#+BEGIN_EXPORT html
<audio controls>
  <source src="../images/autodub/daruk_zh.wav" type="audio/wav">
  Your browser does not support the audio element.
</audio>
#+END_EXPORT

*Bonus*

#+BEGIN_EXPORT html
<audio controls>
  <source src="../images/autodub/daruk_pijiu.wav" type="audio/wav">
  Your browser does not support the audio element.
</audio>
#+END_EXPORT

However, it's not perfect. It's not consistent enough to just let it rip on the entire game and to just call it a day[fn:4]. There are a number of roadblocks which need to be overcome before we can run this on the whole game.

*** Detecting Early Exits

Many times, Qwen3-TTS will emit the end-of-sequence token early, and produce an output which is cut off early before reading the entire line. There is [[https://github.com/QwenLM/Qwen3-TTS/discussions/75][much discussion]] around tricks to make it more likely to pause at the end: stuff like adding '\n' or '...' at the end of your prompt, and so on. I didn't see too much success with these methods, there was always just a huge risk of this happening anyways no matter what I put at the end.

A solution that actually worked was simply retrying until it managed to generate the line without ending early. None of the lines in our set are so long that the early-exit problem is a sure-thing. However, we need some way to programatically check if the early exit occurred or not, otherwise we'll be stuck manually checking tons of files.

Again, we lean on our good friend Cohere-transcribe for solving this problem. Our filtering step here will first generate audio with Qwen3-TTS. Then it will feed that generated audio into Cohere-transcribe, in order to figure out what the audio says. If the audio spoken doesn't match the original line, we need to try again. If it does match, then we've generated something which should be intelligible.

Going further, we convert both lines into [[https://en.wikipedia.org/wiki/Pinyin][hanyu pinyin]] with [[https://github.com/mozillazg/python-pinyin][pipinyin]] in order to minimize false positives caused by cohere-transcribe selecting the wrong character. For example, one of Daruk's lines in Chinese is "小心那家伙的大剑！", which Cohere-transcribe wrote as "小心那家伙的大贱。" These lines are read and spoken in the exact same way, but the original line uses 大剑, meaning "greatsword", whereas the transcription uses 大贱, meaning something vaguely like "big nasty"[fn:6]. As long as the readings match, we can be pretty confident the cut-off problem isn't too bad.

*** Dealing with "Sticky" Lines

Qwen3-TTS is not perfect. Certain things it struggles to say, like <<calamity ganon problem>>

<<currently working on solving this>>

*** Improving Line Delivery

Sometimes the audio generated by Qwen3-TTS is intelligible and sounds good, but produces a delivery which is totally off from the original line. Since we don't provide the original audio in generating the audio generation step (remember: we have a function $f(C) \rightarrow V'$ which we get by using Qwen3-TTS voice cloning $q(V, E) \rightarrow f$), we will sometimes lose the emotional delivery of the line.

Again, heavier and more sophisticated pipelines often have bespoke solutions to this, and we can probably go down a big rabbit hole to finetune these capabilities into Qwen3-TTS somehow. But also good is our old reliable friend Best-of-N.

In short, we will just generate a bunch of examples, and then use the best one. Picking the best reading out of a big group of short audio clips, when provided a reference audio in another language, seems like a relatively easy task. But doing it yourself for every line in the game seems super tedious, so we will leverage [[https://en.wikipedia.org/wiki/LLM-as-a-Judge][LLM-as-judge]] using a multimodal model capable of ingesting audio directly.

For this, we can keep with our local models focus and use [[https://ai.google.dev/gemma/docs/core][Gemma 4 26B E4B]]. This model is a bit heavier than the other two big models we've used in this pipeline so far, but it still comfortably fits on my 3090, and it being a mixture of experts means that the judgments are all pretty fast. Likewise, this model has native support for ingesting audio, which means it's quite nice for something simple like this. We provide this model the original English line reading plus all the candidates, and ask it to select the one which matches the original most closely. A simple napkin test verified that this did tend to pick the candidate audio that I preferred as well[fn:8].

*** Improving Volume Balance

Ideally, the generated audio will be at the same volume as the original line delivery, even if the line is slightly different after translation. Qwen3-TTS doesn't have access to this information in our pipeline, so sometimes it will produce text which is far too quiet compared to the original line.

Thankfully there are really simple postprocessing approaches which work well for this. Pretty standard in the audio mixing world is [[https://majormixing.com/what-is-rms-in-audio-world/][Root Mean Square (RMS)]] scaling, which is something thankfully looks familiar to people who spend a lot of time doing machine learning. We measure the loudness of the source audio and try to scale the output of Qwen3-TTS such that it's a similar volume[fn:11]. 

*** Repackaging Back Into The Game

I use [[https://github.com/thealexbarney/vgaudio][VGAudio]] to repackage all of these generated final candidate audio files back into the necessary BFSTM format. This also requires a simple ffmpeg layer to convert the audio to the appropriate sampling rate and back up into stereo.

From here <<I figure out how to get this shit into CEMU>>.

