articles/autodub.html

<div id="outline-container-orgcc316b9" class="outline-3">
<h3 id="orgcc316b9">Generating the Audio</h3>
<div class="outline-text-3" id="text-orgcc316b9">
<p>
The obvious model to use for this project, at the time of writing, is <a href="https://github.com/QwenLM/Qwen3-TTS">Qwen3-TTS</a>. This model is 1.7B parameters so it easily fits on my RTX 3090. It is obviously specifically performant upon generating voices in Chinese, which is a hugely important part of this particular project. And, importantly, it allows for cloning a particular voice, when provided text-audio pairing. That is to say, you can provide Qwen3-TTS \((V,E)\) and it will produce a function \(f(C) \rightarrow V'\) <sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>. That looks suspiciously like what we just said we wanted!
</p>

<p>
And indeed, it does do a pretty good job right out of the box. The output of this model is crazy impressive<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>, especially for something just 1.7B parameters.
</p>

<p>
<b>English Example</b>
</p>

<audio controls>
  <source src="../images/autodub/daruk_en.wav" type="audio/wav">
  Your browser does not support the audio element.
</audio>

<p>
<b>Chinese Example</b>
</p>

<audio controls>
  <source src="../images/autodub/daruk_zh.wav" type="audio/wav">
  Your browser does not support the audio element.
</audio>

<p>
However, it's not perfect. It's not consistent enough to just let it rip on the entire game and to just call it a day<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>. There are a number of roadblocks which need to be overcome before we can run this on the whole game.
</p>
</div>
</div>

<div id="outline-container-org0a84d9f" class="outline-3">
<h3 id="org0a84d9f">Detecting Early Exits</h3>
<div class="outline-text-3" id="text-org0a84d9f">
<p>
Many times, Qwen3-TTS will emit the end-of-sequence token early, and produce an output which is cut off early before reading the entire line. There is <a href="https://github.com/QwenLM/Qwen3-TTS/discussions/75">much discussion</a> around tricks to make it more likely to pause at the end: stuff like adding '\n' or '&#x2026;' at the end of your prompt, and so on. I didn't see too much success with these methods, there was always just a huge risk of this happening anyways no matter what I put at the end.
</p>

<p>
A solution that actually worked was simply retrying until it managed to generate the line without ending early. None of the lines in our set are so long that the early-exit problem is a sure-thing. However, we need some way to programatically check if the early exit occurred or not, otherwise we'll be stuck manually checking tons of files.
</p>

<p>
Again, we lean on our good friend Cohere-transcribe for solving this problem. Our filtering step here will first generate audio with Qwen3-TTS. Then it will feed that generated audio into Cohere-transcribe, in order to figure out what the audio says. If the audio spoken doesn't match the original line, we need to try again. If it does match, then we've generated something which should be intelligible.
</p>

<p>
Going further, we convert both lines into <a href="https://en.wikipedia.org/wiki/Pinyin">hanyu pinyin</a> with <a href="https://github.com/mozillazg/python-pinyin">pipinyin</a> in order to minimize false positives caused by cohere-transcribe selecting the wrong character. For example, one of Daruk's lines in Chinese is "小心那家伙的大剑！", which Cohere-transcribe wrote as "小心那家伙的大贱。" These lines are read and spoken in the exact same way, but the original line uses 大剑, meaning "greatsword", whereas the transcription uses 大贱, meaning something vaguely like "big nasty"<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>. As long as the readings match, we can be pretty confident the cut-off problem isn't too bad.
</p>
</div>
</div>

<div id="outline-container-org02c976f" class="outline-3">
<h3 id="org02c976f">Dealing with "Sticky" Lines</h3>
<div class="outline-text-3" id="text-org02c976f">
<p>
Qwen3-TTS is not perfect. Certain things it struggles to say, like <a id="orgadde60b"></a>
</p>

<p>
<a id="org18e1b3f"></a>
</p>
</div>
</div>

<div id="outline-container-orgb5efd3e" class="outline-3">
<h3 id="orgb5efd3e">Improving Line Delivery</h3>
<div class="outline-text-3" id="text-orgb5efd3e">
<p>
Sometimes the audio generated by Qwen3-TTS is intelligible and sounds good, but produces a delivery which is totally off from the original line. Since we don't provide the original audio in generating the audio generation step (remember: we have a function \(f(C) \rightarrow V'\) which we get by using Qwen3-TTS voice cloning \(q(V, E) \rightarrow f\)), we will sometimes lose the emotional delivery of the line.
</p>

<p>
Again, heavier and more sophisticated pipelines often have bespoke solutions to this, and we can probably go down a big rabbit hole to finetune these capabilities into Qwen3-TTS somehow. But also good is our old reliable friend Best-of-N.
</p>

<p>
In short, we will just generate a bunch of examples, and then use the best one. Picking the best reading out of a big group of short audio clips, when provided a reference audio in another language, seems like a relatively easy task. But doing it yourself for every line in the game seems super tedious, so we will leverage <a href="https://en.wikipedia.org/wiki/LLM-as-a-Judge">LLM-as-judge</a> using a multimodal model capable of ingesting audio directly.
</p>

<p>
For this, we can keep with our local models focus and use <a href="https://ai.google.dev/gemma/docs/core">Gemma 4 26B E4B</a>. This model is a bit heavier than the other two big models we've used in this pipeline so far, but it still comfortably fits on my 3090, and it being a mixture of experts means that the judgments are all pretty fast. Likewise, this model has native support for ingesting audio, which means it's quite nice for something simple like this. We provide this model the original English line reading plus all the candidates, and ask it to select the one which matches the original most closely. A simple napkin test verified that this did tend to pick the candidate audio that I preferred as well<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>.
</p>
</div>
</div>

<div id="outline-container-orgb008360" class="outline-3">
<h3 id="orgb008360">Improving Volume Balance</h3>
<div class="outline-text-3" id="text-orgb008360">
<p>
Ideally, the generated audio will be at the same volume as the original line delivery, even if the line is slightly different after translation. Qwen3-TTS doesn't have access to this information in our pipeline, so sometimes it will produce text which is far too quiet compared to the original line.
</p>

<p>
Thankfully there are really simple postprocessing approaches which work well for this. Pretty standard in the audio mixing world is <a href="https://majormixing.com/what-is-rms-in-audio-world/">Root Mean Square (RMS)</a> scaling, which is something thankfully looks familiar to people who spend a lot of time doing machine learning. We measure the loudness of the source audio and try to scale the output of Qwen3-TTS such that it's a similar volume<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup>. 
</p>
</div>
</div>

<div id="outline-container-org8768cb5" class="outline-3">
<h3 id="org8768cb5">Repackaging Back Into The Game</h3>
<div class="outline-text-3" id="text-org8768cb5">
<p>
I use <a href="https://github.com/thealexbarney/vgaudio">VGAudio</a> to repackage all of these generated final candidate audio files back into the necessary BFSTM format. This also requires a simple ffmpeg layer to convert the audio to the appropriate sampling rate and back up into stereo.
</p>

<p>
From here <a id="org22afd5d"></a>.
</p>
</div>
</div>
</div>
