org/articles/autodub.org
** Results

<<here are some examples>>

Of course, this is not anything close to the quality bar of actual voice actors reading all of the lines in the game, in consistent character, using the same voice every single time. That is totally okay -- this all ran on my desktop computer and cost me $0.00 to complete[fn:3] so I consider the lower quality to be a fair trade for how much time and money such a project would have cost doing it the normal way.

Overall I was quite pleased with the result of this project. There were many rough edges even after all the little things we added, but it was gratifying seeing it just emerge from my computer after a couple of hours. I know that [[https://bsky.app/profile/tobyfox.undertale.com/post/3mia4smxehk2a][some discourse on official translations]] has transpired in recent months, and I think a reasonable takeaway is that expecting developers to localize their game to a language you're interested in playing it in is not always super feasible.

[[https://mother3.fobby.net/][Fan translations]] are almost always really awesome projects, and I think it's probably a very good thing for the world that the difficulty of these sorts of projects keeps on falling. [[https://en.wikipedia.org/wiki/Le_Ton_beau_de_Marot][Douglas Hofstadter]] has a lot of [[https://en.wikipedia.org/wiki/Le_Ton_beau_de_Marot][beautiful thoughts on the problem of translation]], and I suspect that the value of human translators for artistic text will remain at a premium for a very long time. It makes sense that creators are so hesitant to localize their game in a language they don't speak, since it yields a lot of creative control away from their original artistic intent. <<this paragraph is meandering and need to be cleaned up substantially>>

But at the same time, sometimes people just want to play the damn game, even if the translation they use is a little bit scuffed[fn:9]. The big takeaway here is that machine translation tools are super powerful now, even ones which run directly on mid-tier consumer hardware. If someone doesn't want to localize their product for you, there may be a near future where you can just localize it yourself in a weekend. 

* Footnotes

[fn:11] This is not perfect and this sort of thing is usually the job of a dedicated sound team. But it's pretty good as a first pass, so we can just roll with it.

[fn:10] It's funny to say about a game like Breath of the Wild, but thankfully the game is not /that big/. These can be pretty easily spot-checked based on what fails from the first pass. 

[fn:9] I can't even begin to think about how much manga I've read with totally unreasonable english scanlations. 

[fn:8] A minor annoyance here was that Gemma 4 required transformers 5.5 and Qwen3-TTS required a hardcoded earlier version of transformers. This resulted in me needing to do some submodule juggling with two venvs to make it actually work in a single pipeline. Classic python.

[fn:7] For completeness, consider this a function $q(V, E) \rightarrow f$ where $q$ is the voice cloning function and $f$ is the resulting text-to-speech function using that cloned voice.

[fn:6] For example, [[https://zh.wikipedia.org/zh-cn/%E7%8E%8B%E7%89%8C%E5%A4%A7%E8%B3%A4%E8%AB%9C_(%E9%9B%BB%E5%BD%B1)][Austin Powers in Chinese is 王牌大賤諜]]

[fn:5] Cohere is sort of known for being really strong at multi-lingual stuff, so I chose this model over other transcription models in hopes that it would keep the approach flexible. 

[fn:4] Well, I guess that would be fine for a weekend project like this. But we can aim a little higher. 

[fn:3] Obviously not counting the cost of like, electricity powering my computer during the time it runs, or what have you. The models involved in this project are all super, super lightweight. Better results could probably be achieved using much heavier tools like Elevenlabs, Gemini 3.1 Pro, and so on. This would have cost considerably more, taken much longer, and probably ran into almost all of the same objections.

[fn:2] Not for [[https://planetbanatt.net/articles/mandarin.html][lack of trying]] but I have a long way before this sort of media becomes available for me to understand. 

[fn:1] Very 2026 couple of sentences. 
