articles/autodub.html

<div id="outline-container-org7ea7b8b" class="outline-2">
<h2 id="org7ea7b8b">Results</h2>
<div class="outline-text-2" id="text-org7ea7b8b">
<p>
<a id="orge434969"></a>
</p>

<p>
Of course, this is not anything close to the quality bar of actual voice actors reading all of the lines in the game, in consistent character, using the same voice every single time. That is totally okay &#x2013; this all ran on my desktop computer and cost me $0.00 to complete<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup> so I consider the lower quality to be a fair trade for how much time and money such a project would have cost doing it the normal way.
</p>

<p>
Overall I was quite pleased with the result of this project. There were many rough edges even after all the little things we added, but it was gratifying seeing it just emerge from my computer after a couple of hours. I know that <a href="https://bsky.app/profile/tobyfox.undertale.com/post/3mia4smxehk2a">some discourse on official translations</a> has transpired in recent months, and I think a reasonable takeaway is that expecting developers to localize their game to a language you're interested in playing it in is not always super feasible.
</p>

<p>
<a href="https://mother3.fobby.net/">Fan translations</a> are almost always really awesome projects, and I think it's probably a very good thing for the world that the difficulty of these sorts of projects keeps on falling. <a href="https://en.wikipedia.org/wiki/Le_Ton_beau_de_Marot">Douglas Hofstadter</a> has a lot of <a href="https://en.wikipedia.org/wiki/Le_Ton_beau_de_Marot">beautiful thoughts on the problem of translation</a>, and I suspect that the value of human translators for artistic text will remain at a premium for a very long time. It makes sense that creators are so hesitant to localize their game in a language they don't speak, since it yields a lot of creative control away from their original artistic intent. <a id="orgcdd42d8"></a>
</p>

<p>
But at the same time, sometimes people just want to play the damn game, even if the translation they use is a little bit scuffed<sup><a id="fnr.12" class="footref" href="#fn.12" role="doc-backlink">12</a></sup>. The big takeaway here is that machine translation tools are super powerful now, even ones which run directly on mid-tier consumer hardware. If someone doesn't want to localize their product for you, there may be a near future where you can just localize it yourself in a weekend. 
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Very 2026 couple of sentences. 
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Not for <a href="https://planetbanatt.net/articles/mandarin.html">lack of trying</a> but I have a long way before this sort of media becomes available for me to understand. 
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Cohere is sort of known for being really strong at multi-lingual stuff, so I chose this model over other transcription models in hopes that it would keep the approach flexible. 
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
It's funny to say about a game like Breath of the Wild, but thankfully the game is not <i>that big</i>. These can be pretty easily spot-checked based on what fails from the first pass. 
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
For completeness, consider this a function \(q(V, E) \rightarrow f\) where \(q\) is the voice cloning function and \(f\) is the resulting text-to-speech function using that cloned voice.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I think there's not a good place to put more examples of this which are fun and silly, rather than more serious attempts at solving the problems. So I'll put a few here.
</p>

<audio controls>
  <source src="../images/autodub/daruk_pijiu.wav" type="audio/wav">
  Your browser does not support the audio element.
</audio></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Well, I guess that would be fine for a weekend project like this. But we can aim a little higher. 
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8" role="doc-backlink">8</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
For example, <a href="https://zh.wikipedia.org/zh-cn/%E7%8E%8B%E7%89%8C%E5%A4%A7%E8%B3%A4%E8%AB%9C_(%E9%9B%BB%E5%BD%B1)">Austin Powers in Chinese is 王牌大賤諜</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9" role="doc-backlink">9</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A minor annoyance here was that Gemma 4 required transformers 5.5 and Qwen3-TTS required a hardcoded earlier version of transformers. This resulted in me needing to do some submodule juggling with two venvs to make it actually work in a single pipeline. Classic python.
</p></div></div>

<div class="footdef"><sup><a id="fn.10" class="footnum" href="#fnr.10" role="doc-backlink">10</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
This is not perfect and this sort of thing is usually the job of a dedicated sound team. But it's pretty good as a first pass, so we can just roll with it.
</p></div></div>

<div class="footdef"><sup><a id="fn.11" class="footnum" href="#fnr.11" role="doc-backlink">11</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Obviously not counting the cost of like, electricity powering my computer during the time it runs, or what have you. The models involved in this project are all super, super lightweight. Better results could probably be achieved using much heavier tools like Elevenlabs, Gemini 3.1 Pro, and so on. This would have cost considerably more, taken much longer, and probably ran into almost all of the same objections.
</p></div></div>

<div class="footdef"><sup><a id="fn.12" class="footnum" href="#fnr.12" role="doc-backlink">12</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I can't even begin to think about how much manga I've read with totally unreasonable english scanlations. 
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
